tutorials/openfoam_tutorials/les/NACA4412/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    aerofoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1250;
        startFace       222866;
    }
    inlet
    {
        type            patch;
        nFaces          1402;
        startFace       224116;
    }
    outlet
    {
        type            patch;
        nFaces          256;
        startFace       225518;
    }
    yPeriodic_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          44864;
        startFace       225774;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  yPeriodic_half1;
    }
    yPeriodic_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          44864;
        startFace       270638;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  yPeriodic_half0;
    }
)

// ************************************************************************* //
