tutorials/openfoam_tutorials/les/NACA4412/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    writeInterval   1;

    log             no;

    AoA             13.87;       // Angle-of-attack (deg)
    magUInf         1.0;         // Freestream velocity
    lRef            1.0;         // Chord length
    Aref            #eval{ $lRef*0.004 };  // Chord length times span width

    patches         (aerofoil);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1;           // Required when rho = rhoInf
    liftDir    #eval{vector( -sin(degToRad($AoA)), 0, cos(degToRad($AoA)) )};
    dragDir    #eval{vector(  cos(degToRad($AoA)), 0, sin(degToRad($AoA)) )};
    CofR            (0.25 0 0);  // Aerodynamic center point
    pitchAxis       (0 1 0);
}


// ************************************************************************* //
